___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [10]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
#Dataframes are a bunch of series (columns) with a common index.
df2 = pd.DataFrame(np.random.randint(low = 0,high = 10, size = (3,3)), index = ['A','B','C'], columns = ['Yankees', 'Red Sox', 'Mets'])
print(df2)
# A dataframe in Python is a bunch of series that share the same index!

   Yankees  Red Sox  Mets
A        9        3     5
B        6        6     5
C        5        1     7

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [12]:
df['W']

A    2.010793
B    0.392746
C   -0.229937
D   -1.416207
E    1.179022
Name: W, dtype: float64

In [13]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  2.010793  0.028234
B  0.392746 -1.049912
C -0.229937 -1.522410
D -1.416207  0.498600
E  1.179022 -0.892172

In [15]:
print(df2[['Yankees','Red Sox']])

   Yankees  Red Sox
A        9        3
B        6        6
C        5        1

In [189]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [190]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [16]:
df['new'] = df['W'] + df['Y']

In [192]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
df['hello'] = 0
print(df)

          W         X         Y         Z       new  hello
A  2.010793 -0.137610 -0.598269  0.028234  1.412524      0
B  0.392746 -1.441695  0.000323 -1.049912  0.393069      0
C -0.229937 -1.283599 -2.711192 -1.522410 -2.941129      0
D -1.416207  1.108544  1.131029  0.498600 -0.285178      0
E  1.179022  1.322684  1.852155 -0.892172  3.031176      0

** Removing Columns**

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z  hello
A  2.010793 -0.137610 -0.598269  0.028234      0
B  0.392746 -1.441695  0.000323 -1.049912      0
C -0.229937 -1.283599 -2.711192 -1.522410      0
D -1.416207  1.108544  1.131029  0.498600      0
E  1.179022  1.322684  1.852155 -0.892172      0

In [20]:
# Not inplace unless specified!
df

          W         X         Y         Z       new  hello
A  2.010793 -0.137610 -0.598269  0.028234  1.412524      0
B  0.392746 -1.441695  0.000323 -1.049912  0.393069      0
C -0.229937 -1.283599 -2.711192 -1.522410 -2.941129      0
D -1.416207  1.108544  1.131029  0.498600 -0.285178      0
E  1.179022  1.322684  1.852155 -0.892172  3.031176      0

In [22]:
df.drop('new',axis=1,inplace=True) #inplace = 'True' actually changes this DataFrame
# Important for a bunch of pandas methods

In [23]:
df

          W         X         Y         Z  hello
A  2.010793 -0.137610 -0.598269  0.028234      0
B  0.392746 -1.441695  0.000323 -1.049912      0
C -0.229937 -1.283599 -2.711192 -1.522410      0
D -1.416207  1.108544  1.131029  0.498600      0
E  1.179022  1.322684  1.852155 -0.892172      0

Can also drop rows this way:

In [24]:
df.drop('E',axis=0)

          W         X         Y         Z  hello
A  2.010793 -0.137610 -0.598269  0.028234      0
B  0.392746 -1.441695  0.000323 -1.049912      0
C -0.229937 -1.283599 -2.711192 -1.522410      0
D -1.416207  1.108544  1.131029  0.498600      0

In [26]:
df.shape #returns a tuple of number of rows and columns

(5, 5)

** Selecting Rows**

In [27]:
df.loc['A']

W        2.010793
X       -0.137610
Y       -0.598269
Z        0.028234
hello    0.000000
Name: A, dtype: float64

In [28]:
# Use loc[''] to get a row based on the key value
df2.loc['A']

Yankees    9
Red Sox    3
Mets       5
Name: A, dtype: int64

Or select based off of position instead of label

In [29]:
df.iloc[2]

W       -0.229937
X       -1.283599
Y       -2.711192
Z       -1.522410
hello    0.000000
Name: C, dtype: float64

In [30]:
#Use iloc[2] to get the 3rd row (or typical 2nd index) in python
df2.iloc[2]

Yankees    5
Red Sox    1
Mets       7
Name: C, dtype: int64

** Selecting subset of rows and columns **

In [31]:
df.loc['B','Y']

0.00032283996237403653

In [32]:
df.loc[['A','B'], 'W'] #pull rows A,B and column W

A    2.010793
B    0.392746
Name: W, dtype: float64

In [33]:
df.loc[['A','B'],['W','Y']] # still a dataframe

          W         Y
A  2.010793 -0.598269
B  0.392746  0.000323

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [202]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
print(df2)
# When did the yankees score at least 6 runs?
df2[df2['Yankees']>=6]

   Yankees  Red Sox  Mets
A        9        3     5
B        6        6     5
C        5        1     7

   Yankees  Red Sox  Mets
A        9        3     5
B        6        6     5

In [42]:
df2[df2['Yankees'] >=6]['Yankees'] #the first step gets all rows for which 'Yankees' >= 6 (a subset of the original)
# The second gets the Column 'Yankees' from our subset (and remember that columns of dataframes are Series)

A    9
B    6
Name: Yankees, dtype: int64

In [36]:
df>0

       W      X      Y      Z  hello
A   True  False  False   True  False
B   True  False   True  False  False
C  False  False  False  False  False
D  False   True   True   True  False
E   True   True   True  False  False

In [37]:
df[df>0]

          W         X         Y         Z  hello
A  2.010793       NaN       NaN  0.028234    NaN
B  0.392746       NaN  0.000323       NaN    NaN
C       NaN       NaN       NaN       NaN    NaN
D       NaN  1.108544  1.131029  0.498600    NaN
E  1.179022  1.322684  1.852155       NaN    NaN

In [38]:
df[df['W']>0]

          W         X         Y         Z  hello
A  2.010793 -0.137610 -0.598269  0.028234      0
B  0.392746 -1.441695  0.000323 -1.049912      0
E  1.179022  1.322684  1.852155 -0.892172      0

In [206]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [207]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [208]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [46]:
#If you want to combine conditional selections of a DataFrame use & (for and) or | (for or)
df2[(df2['Yankees'] >= 6) & df2['Mets'] >=1 ]

   Yankees  Red Sox  Mets
A        9        3     5
B        6        6     5

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [209]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
# Reset to default 0,1...n index
df.reset_index() #reset_index is a pretty cool command! It resets the index of the DataFrame to be the numerical row

  index         W         X         Y         Z  hello
0     A  2.010793 -0.137610 -0.598269  0.028234      0
1     B  0.392746 -1.441695  0.000323 -1.049912      0
2     C -0.229937 -1.283599 -2.711192 -1.522410      0
3     D -1.416207  1.108544  1.131029  0.498600      0
4     E  1.179022  1.322684  1.852155 -0.892172      0

In [211]:
newind = 'CA NY WY OR CO'.split()

In [212]:
df['States'] = newind

In [213]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [52]:
#Let's make a new index that will be the day of the week
day = 'Monday Tuesday Wednesday'.split()
df2['day'] = day
df2
df2.set_index('day')

           Yankees  Red Sox  Mets
day
Monday           9        3     5
Tuesday          6        6     5
Wednesday        5        1     7

In [214]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [215]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [216]:
df.set_index('States',inplace=True)

In [218]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [53]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [54]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [55]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])#Multi-index dataframe
df
# This dataframe has an index hierarchy

             A         B
G1 1 -1.826066  1.257824
   2  1.291497 -0.200139
   3  1.255905 -0.621076
G2 1 -0.090848  0.439521
   2 -0.615106 -1.609852
   3  0.687993 -0.119198

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [56]:
df.loc['G1']

          A         B
1 -1.826066  1.257824
2  1.291497 -0.200139
3  1.255905 -0.621076

In [57]:
df.loc['G1'].loc[1] #call from the outside index and then continue to call deeper

A   -1.826066
B    1.257824
Name: 1, dtype: float64

In [61]:
a = df.loc['G1'].loc[[1,2]]
b = df.loc['G2'].loc[[1,2]]
pd.concat([a,b]) #concatenate the 'a' and 'b' dataframe

          A         B
1 -1.826066  1.257824
2  1.291497 -0.200139
1 -0.090848  0.439521
2 -0.615106 -1.609852

In [63]:
df.loc['G2'].loc[2]['B']

-1.6098519776133684

In [265]:
df.index.names

FrozenList([None, None])

In [266]:
df.index.names = ['Group','Num']

In [267]:
df

                  A         B
Group Num
G1    1    0.153661  0.167638
      2   -0.765930  0.962299
      3    0.902826 -0.537909
G2    1   -1.549671  0.435253
      2    1.259904 -0.447898
      3    0.266207  0.412580

In [270]:
df.xs('G1')

            A         B
Num
1    0.153661  0.167638
2   -0.765930  0.962299
3    0.902826 -0.537909

In [271]:
df.xs(['G1',1])

A    0.153661
B    0.167638
Name: (G1, 1), dtype: float64

In [273]:
df.xs(1,level='Num')

              A         B
Group
G1     0.153661  0.167638
G2    -1.549671  0.435253

# Great Job!